###############################################################################
# Created by write_sdc
###############################################################################
current_design hw_scheduler_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_uncertainty 0.0600 clk
set_clock_latency -source 0.0000 [get_clocks {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[0]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[1]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[2]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[3]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[4]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[5]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[6]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {ext_irq[7]}]
set_input_delay 3.9900 -clock [get_clocks {clk}] -max -add_delay [get_ports {ext_irq[7]}]
set_input_delay 0.8500 -clock [get_clocks {clk}] -min -add_delay [get_ports {rst_n}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {rst_n}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {scan_en}]
set_input_delay 3.8400 -clock [get_clocks {clk}] -max -add_delay [get_ports {scan_en}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {scan_in}]
set_input_delay 3.2700 -clock [get_clocks {clk}] -max -add_delay [get_ports {scan_in}]
set_input_delay 0.2700 -clock [get_clocks {clk}] -min -add_delay [get_ports {uart_rx}]
set_input_delay 4.7100 -clock [get_clocks {clk}] -max -add_delay [get_ports {uart_rx}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {irq_n}]
set_output_delay 8.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {irq_n}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {scan_out}]
set_output_delay 3.7200 -clock [get_clocks {clk}] -max -add_delay [get_ports {scan_out}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {uart_tx}]
set_output_delay 3.7200 -clock [get_clocks {clk}] -max -add_delay [get_ports {uart_tx}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {irq_n}]
set_load -pin_load 0.1900 [get_ports {scan_out}]
set_load -pin_load 0.1900 [get_ports {uart_tx}]
set_input_transition 0.6100 [get_ports {clk}]
set_input_transition -min 0.0900 [get_ports {scan_en}]
set_input_transition -max 0.1400 [get_ports {scan_en}]
set_input_transition -min 0.0900 [get_ports {scan_in}]
set_input_transition -max 0.1800 [get_ports {scan_in}]
set_input_transition -min 0.0700 [get_ports {uart_rx}]
set_input_transition -max 0.8400 [get_ports {uart_rx}]
set_input_transition -min 0.0700 [get_ports {ext_irq[7]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[7]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[6]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[6]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[5]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[5]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[4]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[4]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[3]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[3]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[2]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[2]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[1]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[1]}]
set_input_transition -min 0.0700 [get_ports {ext_irq[0]}]
set_input_transition -max 0.9200 [get_ports {ext_irq[0]}]
set_case_analysis 0 [get_ports {scan_en}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 24.0000 [current_design]
